/*----------------------------------------------------------------------------*/
/* SPDX-License-Identifier: GPL-2.0                                           */
/*                                                                            */
/* Copyright (c) 2010-2019 by Nuvoton Technology Corporation                  */
/* All rights reserved                                                        */
/*                                                                            */
/*----------------------------------------------------------------------------*/
/* File Contents:                                                             */
/*   mc_regs.h                                                                */
/*            This file contains registers definition of Memory Controler     */
/* Project:                                                                   */
/*            SWC HAL                                                         */
/*----------------------------------------------------------------------------*/

#ifndef _MC_REGS_H
#define _MC_REGS_H

#include __CHIP_H_FROM_DRV()


/**************************************************************************************************************************/
/*   Register SCL_START                                                                                                   */

/*   Register VREF_TRAINING_WINDOWS                                                                                       */
/**************************************************************************************************************************/
#define  VREF_TRAINING_WINDOWS          (MCPHY_BASE_ADDR + 0x1D4) , MCPHY_ACCESS, 32        /* Offset: 1D4h */
#define  VREF_TRAINING_WINDOWS_ddr_window_1  24 , 6             /* 29-24 ddr_window_1. Measured size, in delay steps, of the 1 portion of the write data eye.                            */
#define  VREF_TRAINING_WINDOWS_ddr_window_0  16 , 6             /* 21-16 ddr_window_0. Measured size, in delay steps, of the 0 portion of the write data eye.                            */
#define  VREF_TRAINING_WINDOWS_window_1  8 , 8              /* 15-8 window_1. Measured size, in delay steps, of the 1 portion of the read data eye.                                  */
#define  VREF_TRAINING_WINDOWS_window_0  0 , 6              /* 5-0 window_0. Measured size, in delay steps, of the 0 portion of the read data eye.                                   */

/**************************************************************************************************************************/
/*   Register DC_PARAM_OUT                                                                                                */
/**************************************************************************************************************************/
#define  DC_PARAM_OUT                   (MCPHY_BASE_ADDR + 0x1D8) , MCPHY_ACCESS, 32        /* Offset: 1D8h */
#define  DC_PARAM_OUT_dc_param_wdata     0 , 32             /* 31-0 dc_param_wdata. Data to be sent on DDR I/Os for test purposes.                                                   */

/**************************************************************************************************************************/
/*   Register DC_PARAM_SEL                                                                                                */
/**************************************************************************************************************************/
#define  DC_PARAM_SEL                   (MCPHY_BASE_ADDR + 0x1DC) , MCPHY_ACCESS, 32        /* Offset: 1DCh */
#define  DC_PARAM_SEL_dc_param_rdata     12 , 9             /* 20-12 dc_param_rdata. Holds the input from the DDR as {jtag_ip_dqs, jtag_ip_dq} for the byte lane selected            */
#define  DC_PARAM_SEL_dc_param_sel       4 , 5              /* 8-4 dc_param_sel. Set to target the desired PHY byte lane for the test input or output. Program hex value             */
#define  DC_PARAM_SEL_dc_param_mode      1 , 2              /* 2-1 dc_param_mode. Program to switch between DC parametric modes as follows;                                          */
#define  DC_PARAM_SEL_dc_param_enable    0 , 1               /* 0 dc_param_enable  Enables the test mode output value and test mode output enable for DDR I/Os                        */




typedef struct _MC_REGISTERS_
{
    UINT32   reg_SCL_START  ;                       //100h Varies per bit 0000_0000h
    UINT32   reg_SCL_DATA_0  ;                       //104h R/W 789B_3DEh
    UINT32   reg_SCL_DATA_1  ;                       //108h R/W F10E_4A56h
    UINT32   reg_SCL_LATENCY  ;                       //10Ch R/W 0000_5262h
    UINT32   reg_SCL_RD_ADDR  ;                       //110h R/W 0000_0040h
    UINT32   reg_SCL_RD_DATA  ;                       //114h R Undefined
    UINT32   reg_SCL_CONFIG_1  ;                       //118h R/W 0100_40B5h
    UINT32   reg_SCL_CONFIG_2  ;                       //11Ch R/W 1300_0801h
    UINT32   reg_PHY_PAD_CTRL  ;                       //120h R/W 5044_404Bh
    UINT32   reg_PHY_DLL_RECALIB  ;                       //124h R/W 3400_0000h
    UINT32   reg_PHY_DLL_ADRCTRL  ;                       //128h Variesper bit0000_0000h
    UINT32   reg_PHY_LANE_SEL  ;                       //12Ch R/W 0000_0000h
    UINT32   reg_PHY_DLL_TRIM_1  ;                       //130h R/W 0000_0000h
    UINT32   reg_PHY_DLL_TRIM_2  ;                       //134h Varies per bit 0000_0000h
    UINT32   reg_PHY_DLL_TRIM_3  ;                       //138h R/W 0000_0000h
    UINT32   reg_SCL_DCAPCLK_DLY  ;                       //13Ch R/W 0000_0010h
    UINT32   reg_SCL_MAIN_CLK_DELTA  ;                       //140h Varies per bit 0000_0000h
    UINT32   reg_PHY_ERR_INJECT  ;                       //144h R/W 0000_0000h
    UINT32   reg_WRLVL_CTRL  ;                       //148h Varies per bit 0000_0000h
    UINT32   reg_WRLVL_AUTOINC_TRIM  ;                       //14Ch Varies per bit 0000_0000h
    UINT32   reg_WRLVL_DYN_ODT  ;                       //150h R/W 0218_0018h
    UINT32   reg_WRLVL_ON_OFF  ;                       //154h R/W 00C6_0046h
    UINT32   reg_UNQ_ANALOG_DLL_1  ;                       //15Ch R/W 0000_0007h
    UINT32   reg_UNQ_ANALOG_DLL_2  ;                       //160h R 0000_0000h
    UINT32   reg_PHY_DLL_INCR_TRIM_1  ;                       //164h R/W 0000_0000h
    UINT32   reg_PHY_DLL_INCR_TRIM_3  ;                       //168h R/W 0000_0000h
    UINT32   reg_UNIQUIFY_IO_1  ;                       //170h Varies per bit 0000_0000h
    UINT32   reg_UNIQUIFY_IO_2  ;                       //174h RO Undefined
    UINT32   reg_UNIQUIFY_ADDR_CTRL_LOOPBACK_1  ;                       //178h Varies  er bit 0000_0000h
    UINT32   reg_UNIQUIFY_ADDR_CTRL_LOOPBACK_2  ;                       //17Ch R 0000_0000h
    UINT32   reg_UNIQUIFY_DLL_LPBK_1  ;                       //180h R/W 0000_0000h
    UINT32   reg_PHY_SCL_START_ADDR  ;                       //188h R/W 0000_0000h
    UINT32   reg_PHY_DLL_RISE_FALL  ;                       //18Ch Varies per bit 0000_0006h
    UINT32   reg_UNQ_ANALOG_DLL_3  ;                       //190h Varies per bit 0000_1010h
    UINT32   reg_IP_DQ_DQS_BITWISE_TRIM  ;                       //194h Varies per bit 0000_0000h
    UINT32   reg_DSCL_CNT  ;                       //19Ch R/W 0000_0000h
    UINT32   reg_OP_DQ_DM_DQS_BITWISE_TRIM  ;                       //1A0h R/W 0000_0000h
    UINT32   reg_PHY_DLL_TRIM_CLK  ;                       //1A4h R/W 0000_0000h
    UINT32   reg_DYNAMIC_BIT_LVL  ;                       //1ACh Varies per bit 0000_2770h
    UINT32   reg_PHY_REV_CNTRL_REG  ;                       //1B0h R 0001_0812h
    UINT32   reg_SCL_WINDOW_TRIM  ;                       //1B4h R/W 0000_0000h
    UINT32   reg_DISABLE_GATING_FOR_SCL  ;                       //1B8h R/W 0000_0000h
    UINT32   reg_SCL_CONFIG_4  ;                       //1BCh R/W 0000_0000h
    UINT32   reg_DYNAMIC_WRITE_BIT_LVL  ;                       //1C0h Varies per bit 0000_0000h
    UINT32   reg_DDR4_CONFIG_1  ;                       //1C4h R/W 0000_0000h
    UINT32   reg_VREF_TRAINING  ;                       //1C8h R/W 0000_0004h
    UINT32   reg_VREF_TRAINING_WINDOWS  ;                       //1D4h R Undefined
    UINT32   reg_DC_PARAM_OUT  ;                       //1D8h R/W 0000_0000h
    UINT32   reg_DC_PARAM_SEL  ;                       //1DCh Varies per bit 0000_0000h
} MC_REGS_T;



// lior
#define MC_DDR_DLL_ENABLE   ((UINT32)1<<0)
#define MC_DDR_DRV_48       ((UINT32)1<<1)
#define MC_DDR_DRV_34       ((UINT32)0<<1)
#define MC_DDR_AL_DISABLE   ((UINT32)0<<3) // 00:Disable, 10:CL-2, 01:CL-1
#define MC_DDR_WL_ENABLE    ((UINT32)1<<7)
#define MC_DDR_ODT_NO       ((UINT32)0<<8)
#define MC_DDR_ODT_60       ((UINT32)1<<8)
#define MC_DDR_ODT_120      ((UINT32)2<<8)
#define MC_DDR_ODT_40       ((UINT32)3<<8)
#define MC_DDR_ODT_240      ((UINT32)4<<8)
#define MC_DDR_ODT_48       ((UINT32)5<<8)
#define MC_DDR_ODT_80       ((UINT32)6<<8)
#define MC_DDR_ODT_34       ((UINT32)7<<8)


/*---------------------------------------------------------------------------------------------------------*/
/* In DENALI_CTL_80_DATA register and WRLVL_ON_OFF register change to MC_DDR_DRV_48, MC_DDR_ODT_120. - check*/
